// 1. Написать условие которое будет истинно только если X это строка, Y равен 10, а Z больше или равно Y.
// var X, Y, Z;
// console.log(/*условие*/);
// *************************************************************************

// var X = "flame", Y = 10, Z =14;

// if (typeof(X) === "string" && Y === 10 && Z >= Y) {
	// console.log('typeof(X) === "string" && Y === 10 && Z >= Y');
// }

// *************************************************************************
// 2. Написать условие которое будет истинно только если X больше 10 или Y и Y является числом или Z кратно 2.
// var X, Y, Z;
// console.log(/*условие*/);
// *************************************************************************

// var X = 14, Y = 2, Z = 18;

// if ((X > 10 || X > Y) && ((typeof(Y) === "number") && !(Z % 2))) {
	// console.log(((X > 10 || X > Y) && ((typeof(Y) === "number") && !(Z % 2))));
// }

// *************************************************************************
// 3. Написать условие которое будет истинно только если сумма X и Y кратна 10, а среднее арифметическое X, Y и Z умноженное на 2 больше 100.
// var X, Y, Z;
// console.log(/*условие*/);
// *************************************************************************

// var X = 614, Y = 236, Z = 69;

// if( !((X + Y)%10 ) && ( 2*(X + Y + Z)/3 ) > 100 )          {
	// console.log('((X + Y)%10 ) && ( 2*(X + Y + Z)/3 ) > 100 ');
// }

// *************************************************************************
// 4. Написать тернарный оператор который будет записывать в переменную X значение Y, если оно кратно трём или значение Z если оно больше Y или сумму Y и Z.
// var X, Y, Z;
// var X = /* решение */;
// console.log(X);
// *************************************************************************

// var X = 1, Y = 2, Z = 3;
// var X = !(Y % 3)/* if */ ? /* than */ Y : /* иначе */ Z /* if */ ? /* than */ Z > Y : /* иначе */ Y + Z;
// console.log(X);

// *************************************************************************
// 5. Написать условие, которое запишет в переменную X первое значение среди переменных Y, Z, которое не число или null используя if...else;
// var X, Y, Z;
// / * Ваше решение */
// console.log(X);
// *************************************************************************
// формулировка "не число или null" позволяет двояко трактовать условие:
//1. не число и не null
//2. не число или является null
// я решил по смыслу первого варианта
// *************************************************************************

// var X = 1, Y = 2, Z = 3;

// if( typeof(Y) != 'number' && typeof(Y) != 'null' ) {
	// X = Y;
// }else if(typeof(Z) != 'number' && typeof(Z) != 'null') {
	// X = Z;
// }else{
	// X = 'var Y = "number" or var Y = "null". var Z = "number" or var Z = "null",';
// }

// console.log(X);

// *************************************************************************
// 6. Написать условие которое будет истинно только если Y не false и записать в перемененную X true в виде строки или Z используя if...else.
// var X, Y, Z;
// / * Ваше решение */
// console.log(X);
// *************************************************************************

// var X = 1, Y = 2, Z = 3;

// if ( Y != false) {
	// X = "true";
// }else {
	// X = Z;
// }

// console.log(X);

// *************************************************************************
// 7. Написать условие, которое запишет в переменную X, значение Y если оно равно 0 или false или undefined или null или значение Z приведённое к числу switch...case.
// var X, Y, Z;
// / * Ваше решение */
// console.log(X);
// *************************************************************************

// var X = 1, Y = 0, Z = '3';

// switch(Y) {
	// case 0:
	// X = Y;
	// case false:
	// X = Y;
	// case undefined:
	// X = Y;
	// case null:
	// X = Y;
	// break;
	// default:
	// X = +Z;
	
// }

// console.log(X);

// *************************************************************************
// 8. Сделать то же самое но без оператора break; в тех кейсах, где он не нужен.
// var X, Y, Z;
// / * Ваше решение */
// console.log(X); 
// *************************************************************************

// *************************************************************************
// 9. Дан массив arr, в котором могут храниться разнотипные данные, пройтись по массиву всеми известными циклами(в разных решениях) и получить по окончании работы цикла новый массив из тех значений который при приведении к boolean дают true.
// var arr = ["", "0", 0, true, undefined, NaN, 234, "ololo", -1, [], {}];
// /* ваш код */
// console.log(/* ваш новый массив */);
// *************************************************************************
// 9.while

// var arr = ["", "0", 0, true, undefined, NaN, 234, "ololo", -1, [], {}];
// var i = 0, j = 0, a = 0;
// var trueSortArr = [];
// while( i <= arr.length) {
	// if( !!arr[i] == true) {
		// trueSortArr[j] = arr[i];
		// console.log(trueSortArr[j]);
		// j++;
	// }
	// i++;
// }

// *************************************************************************
// 9.do while

// var arr = ["", "0", 0, true, undefined, NaN, 234, "ololo", -1, [], {}];
// var i = 0, j = 0;
// var trueSortArr = [];
// do {
	// if( !!arr[i] == true) {
		// trueSortArr[j] = arr[i];
		// console.log(trueSortArr[j]);
		// j++;
	// }
	// i++;
// }while( i < arr.length)

// *************************************************************************
// 9.for

// var arr = ["", "0", 0, true, undefined, NaN, 234, "ololo", -1, [], {}];
// var i = 0, j = 0, a = 0;
// var trueSortArr = [];
// for(; i <= arr.length; i++) {
	// if( !!arr[i] == true) {
		// trueSortArr[j] = arr[i];
		// console.log(trueSortArr[j]);
		// j++;
	// }
// }

// *************************************************************************
// 10. Дан массив arr, в котором могут храниться разнотипные данные, пройтись по массиву всеми известными циклами(в разных решениях) и получить по окончании работы цикла новый массив из тех значений которые являются числом или строкой которую можно к нему привести, а также являются положительными. var arr = ["0", 0, undefined, 234, 15, -29, "-287", "", [1, 2, 3], {key: "value"}, "test", false];
// console.log(/* ваш новый массив */);
// *************************************************************************
// 10. while

// var arr = ["0", 0, undefined, 234, 15, -29, "-287", "", [1, 2, 3], {key: "value"}, "test", false];
// var i = 0, j = 0;
// var positiveNumberArr = [];
// while( i <= arr.length) {
	// if( typeof(+arr[i]) == 'number' && (+arr[i]) > 0) {
		// positiveNumberArr[j] = +arr[i];
		// console.log( + positiveNumberArr[j]);
		// j++;
	// }
	// i++;
// }

// *************************************************************************
// 10. do while

// var arr = ["0", 0, undefined, 234, 15, -29, "-287", "", [1, 2, 3], {key: "value"}, "test", false];
// var i = 0, j = 0;
// var positiveNumberArr = [];
// do {
	// if( typeof(+arr[i]) == 'number' && (+arr[i]) > 0) {
		// positiveNumberArr[j] = +arr[i];
		// console.log(+ positiveNumberArr[j]);
		// j++;
	// }
	// i++;
// } while( i < arr.length)

// *************************************************************************
// 10. for

// var arr = ["0", 0, undefined, 234, 15, -29, "-287", "", [1, 2, 3], {key: "value"}, "test", false];
// var i = 0, j = 0;
// var positiveNumberArr = [];
// for( ; i <= arr.length; i++) {
	// if( typeof(+arr[i]) == 'number' && (+arr[i]) > 0) {
		// positiveNumberArr[j] = +arr[i];
		// console.log(+ positiveNumberArr[j]);
		// j++;
	// }
// }

// *************************************************************************
// 11. Сгенерировать массив, который состоит из чисел от 1 до 99, каждое и рассортировать результаты в 3 равных массивов, которые будут чередовать значения исходного массива, тоесть [1], [2], [3].
// var baseArray = [];
// /* код вашего генератора */
// var newArray1 = [];
// var newArray2 = [];
// var newArray3 = [];
// /* код вашего сортировщика */
// console.log(newArray1 , newArray2, newArray3 );
// *************************************************************************

var baseArray = [];
var i,j;

for( i = 1; i < 100; i++) {
	baseArray[i] = i;
}

var newArray1 = [];
var newArray2 = [];
var newArray3 = [];

for( i = 1, j = 1; i < 100; i++) {
	
	newArray1[j] = baseArray[i];
	i++;
	newArray2[j] = baseArray[i];
	i++;
	newArray3[j] = baseArray[i];
	j++;
}

console.log(newArray1, newArray2, newArray3);

// *************************************************************************